Revit 2026 API

# AlignmentGetClosestPoint Method

---

Calculates the point on the alignment's geometry which is closest to the given model point.

**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ GetClosestPoint(
	XYZ point
)
```
```vb
Public Function GetClosestPoint (
	point As XYZ
) As XYZ
```
```cpp
public:
XYZ^ GetClosestPoint(
	XYZ^ point
)
```
```fsharp
member GetClosestPoint :
        point : XYZ -> XYZ
```

#### Parameters

point XYZ
    The model point for which to calculate the closest point.

#### Return Value

XYZThe alignment point closest to the given model point.

#### Reference

Alignment Class

Autodesk.Revit.DB.Infrastructure Namespace